api/tests/stress/results/ab_workorders_list.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/work-orders
Document Length:        1745 bytes

Concurrency Level:      20
Time taken for tests:   3.471 seconds
Complete requests:      100
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      193400 bytes
HTML transferred:       174500 bytes
Requests per second:    28.81 [#/sec] (mean)
Time per request:       694.141 [ms] (mean)
Time per request:       34.707 [ms] (mean, across all concurrent requests)
Transfer rate:          54.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5   33  35.8     17     120
Processing:    99  604 139.3    622    1012
Waiting:       51  602 141.2    622    1012
Total:        109  637 143.2    636    1120

Percentage of the requests served within a certain time (ms)
  50%    636
  66%    673
  75%    699
  80%    728
  90%    808
  95%    840
  98%   1093
  99%   1120
 100%   1120 (longest request)