api/tests/stress/results/ab_workorders_list.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/work-orders
Document Length:        39 bytes

Concurrency Level:      20
Time taken for tests:   2.783 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Keep-Alive requests:    0
Total transferred:      39500 bytes
HTML transferred:       3900 bytes
Requests per second:    35.93 [#/sec] (mean)
Time per request:       556.667 [ms] (mean)
Time per request:       27.833 [ms] (mean, across all concurrent requests)
Transfer rate:          13.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        8   29  24.1     18      92
Processing:    33  488 126.1    512     673
Waiting:       27  486 126.4    512     673
Total:         41  517 119.4    536     765

Percentage of the requests served within a certain time (ms)
  50%    536
  66%    572
  75%    596
  80%    610
  90%    638
  95%    660
  98%    680
  99%    765
 100%    765 (longest request)