api/tests/stress/results/ab_workreports_list.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/work-reports
Document Length:        72 bytes

Concurrency Level:      20
Time taken for tests:   3.075 seconds
Complete requests:      100
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      26100 bytes
HTML transferred:       7200 bytes
Requests per second:    32.52 [#/sec] (mean)
Time per request:       614.933 [ms] (mean)
Time per request:       30.747 [ms] (mean, across all concurrent requests)
Transfer rate:          8.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        6   28  35.5     13     133
Processing:    68  526 120.7    550     710
Waiting:       61  525 121.0    549     706
Total:         81  553 110.6    574     726

Percentage of the requests served within a certain time (ms)
  50%    574
  66%    604
  75%    629
  80%    637
  90%    656
  95%    691
  98%    712
  99%    726
 100%    726 (longest request)