api/tests/stress/results/ab_workreports_list.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/work-reports
Document Length:        39 bytes

Concurrency Level:      20
Time taken for tests:   2.720 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Keep-Alive requests:    0
Total transferred:      39500 bytes
HTML transferred:       3900 bytes
Requests per second:    36.77 [#/sec] (mean)
Time per request:       543.923 [ms] (mean)
Time per request:       27.196 [ms] (mean, across all concurrent requests)
Transfer rate:          14.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        7   28  27.3     16      92
Processing:    42  471 112.3    500     625
Waiting:       29  470 112.9    500     624
Total:         50  498  99.0    518     670

Percentage of the requests served within a certain time (ms)
  50%    518
  66%    541
  75%    552
  80%    562
  90%    585
  95%    603
  98%    644
  99%    670
 100%    670 (longest request)