api/tests/stress/results/phase4_dashboard_reads.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/dashboard/all
Document Length:        39 bytes

Concurrency Level:      10
Time taken for tests:   3.911 seconds
Complete requests:      50
Failed requests:        0
Non-2xx responses:      50
Keep-Alive requests:    0
Total transferred:      19701 bytes
HTML transferred:       1950 bytes
Requests per second:    12.79 [#/sec] (mean)
Time per request:       782.120 [ms] (mean)
Time per request:       78.212 [ms] (mean, across all concurrent requests)
Transfer rate:          4.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5   21  12.9     17      60
Processing:   188  701 578.9    391    2044
Waiting:      184  700 579.2    391    2043
Total:        208  722 590.3    413    2104

Percentage of the requests served within a certain time (ms)
  50%    413
  66%    646
  75%    769
  80%   1657
  90%   1905
  95%   1970
  98%   2104
  99%   2104
 100%   2104 (longest request)