api/tests/stress/results/phase4_tickets_reads.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/tickets
Document Length:        39 bytes

Concurrency Level:      5
Time taken for tests:   3.944 seconds
Complete requests:      30
Failed requests:        0
Non-2xx responses:      30
Keep-Alive requests:    0
Total transferred:      11823 bytes
HTML transferred:       1170 bytes
Requests per second:    7.61 [#/sec] (mean)
Time per request:       657.397 [ms] (mean)
Time per request:       131.479 [ms] (mean, across all concurrent requests)
Transfer rate:          2.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        9   22  10.9     21      51
Processing:    65  608 438.9    395    1615
Waiting:       61  606 438.8    394    1615
Total:         99  630 445.5    414    1666

Percentage of the requests served within a certain time (ms)
  50%    414
  66%    514
  75%    745
  80%   1150
  90%   1497
  95%   1573
  98%   1666
  99%   1666
 100%   1666 (longest request)