api/tests/stress/results/phase4_tickets_reads.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/tickets
Document Length:        27458 bytes

Concurrency Level:      5
Time taken for tests:   6.817 seconds
Complete requests:      30
Failed requests:        29
   (Connect: 0, Receive: 0, Length: 29, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      1158647 bytes
HTML transferred:       1152977 bytes
Requests per second:    4.40 [#/sec] (mean)
Time per request:       1136.194 [ms] (mean)
Time per request:       227.239 [ms] (mean, across all concurrent requests)
Transfer rate:          165.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       13   34  29.0     22     100
Processing:   378  988 493.1    996    1787
Waiting:      378  987 491.9    994    1787
Total:        397 1022 510.9   1019    1887

Percentage of the requests served within a certain time (ms)
  50%   1019
  66%   1150
  75%   1542
  80%   1604
  90%   1787
  95%   1860
  98%   1887
  99%   1887
 100%   1887 (longest request)